
&НаСервере
Процедура СохранитьНаСервере()
	Настройки = МИКО_аиAPI.ПолучитьНастройкиПодключения();
	ЗаполнитьЗначенияСвойств(Настройки, ЭтаФорма);
	МИКО_аиAPI.СохранитьНастройки(Настройки);
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	СохранитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Настройки = МИКО_аиAPI.ПолучитьНастройкиПодключения();
	ЗаполнитьЗначенияСвойств(ЭтаФорма, Настройки);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПроверитьНаСервере()
	ДанныеСессии = Неопределено;
	HTTP = МИКО_аиAPI.СоединениеСАТС(ДанныеСессии);
    Если HTTP = Неопределено Тогда
	 	Сообщить("Ошибка соединения с АТС.");
	Иначе	
	 	Сообщить("Соединение с АТС прошло успешно.");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Проверить(Команда)
	ПроверитьНаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СинхронизацияЗадачНаСервере()
	МИКО_аиСинхронизация.СинхронизацияОпросов();   
	МИКО_аиСинхронизация.СонхронизацияЗадач();   
КонецПроцедуры

&НаКлиенте
Процедура СинхронизацияЗадач(Команда)
	СинхронизацияЗадачНаСервере();
КонецПроцедуры                            
