
Процедура ПриЗаписи(Отказ) 
	
	Если НЕ ЗначениеЗаполнено(Ответственный) Тогда
		Возврат;
	КонецЕсли;
	
	НЗ = РегистрыСведений.МИКО_Responsibles.СоздатьНаборЗаписей();
	НЗ.Отбор.Контрагент.Установить(Ссылка); 
	МЗ = НЗ.Добавить();
	
	МЗ.phoneId 		= МИКО_аиAPI.ПреобразоватьНомерДляСохранения(НомерТелефона);
    МЗ.Контрагент 	= Ссылка;
	МЗ.number	 	= МИКО_аиAPI.УбратьИзСтрокиТелефонаВсеБуквы(НомерТелефона);
	МЗ.name 		= Наименование;
	МЗ.employeeId   = Ответственный.УникальныйИдентификатор();
	
	НЗ.Записать();
	
КонецПроцедуры
