

Процедура ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка ИЛИ ПометкаУдаления Тогда	     Возврат;	КонецЕсли;
	 
	Для каждого СтрокаДанных Из НомераТелефонов Цикл
		СтрокаДанных.Номер   = МИКО_аиAPI.УбратьИзСтрокиТелефонаВсеБуквы(СтрокаДанных.Номер);
		СтрокаДанных.phoneId = МИКО_аиAPI.ПреобразоватьНомерДляСохранения(СтрокаДанных.Номер);			
	КонецЦикла;
	врНомера 	= НомераТелефонов.Выгрузить().Скопировать();	
	numbers = Новый Массив; 
	Для каждого данныеНомера Из врНомера Цикл
		Если ТипЗнч(данныеНомера.Клиент) = Тип("Строка") Тогда
			clientId = СокрЛП(данныеНомера.Клиент);
		ИначеЕсли ЗначениеЗаполнено(данныеНомера.Клиент) Тогда	
		    clientId = Строка(данныеНомера.Клиент.УникальныйИдентификатор());
		Иначе
			clientId = "";
		КонецЕсли;
		
		врtimeCallAllow = Строка(данныеНомера.timeCallAllow); 
		Если НЕ ЗначениеЗаполнено(данныеНомера.timeCallAllow) и ЗначениеЗаполнено(timeCallAllow) Тогда
			врtimeCallAllow = Строка(timeCallAllow);
		КонецЕсли;
		Если ЗначениеЗаполнено(данныеНомера.ПараметSpeach) Тогда
			params = Новый Структура();
			params.Вставить("speach", данныеНомера.ПараметSpeach);
			params.Вставить("speach1", данныеНомера.ПараметSpeach1);
			params.Вставить("speach2", данныеНомера.ПараметSpeach2);
			numbers.Добавить(Новый Структура("number,params,timeCallAllow,clientId", данныеНомера.Номер, params, врtimeCallAllow, clientId));
		Иначе	                                                                 
			numbers.Добавить(Новый Структура("number,timeCallAllow,clientId", данныеНомера.Номер, врtimeCallAllow,clientId));
		КонецЕсли;
	КонецЦикла;
	
	врНомера 	= Неопределено;
	
	Если ТипЗнч(ВнутреннийНомер) = Тип("Строка") Тогда
		innerNum = ВнутреннийНомер;
		innerNumType = "exten";
	Иначе	
		innerNum = ВнутреннийНомер.ИдентификаторОпроса; 
		innerNumType = "polling";
	КонецЕсли;
	
	ДанныеЗадачи = Новый Структура; 	      
	ДанныеЗадачи.Вставить("crmId", Номер);
	ДанныеЗадачи.Вставить("name", 	НаименованиеЗадачи);
	ДанныеЗадачи.Вставить("state", Состояние);
	ДанныеЗадачи.Вставить("innerNum", innerNum);
	ДанныеЗадачи.Вставить("innerNumType", innerNumType);
	ДанныеЗадачи.Вставить("maxCountChannels", МаксимальноеЧислоКаналов);
	ДанныеЗадачи.Вставить("numbers", numbers);
	ДанныеЗадачи.Вставить("maxAttempt", maxAttempt);
	ДанныеЗадачи.Вставить("tryInterval", tryInterval);  
	
	Если ЗначениеЗаполнено(timeStart) Тогда
		ДанныеЗадачи.Вставить("timeStart", (timeStart - Дата("00010101") )/ 60);        
	КонецЕсли;
	Если ЗначениеЗаполнено(timeStart) Тогда
		ДанныеЗадачи.Вставить("timeEnd", (timeEnd - Дата("00010101") )/ 60);        
	КонецЕсли;
	
	ДанныеЗадачи.Вставить("attemptUntilSignal", ?(attemptUntilSignal,1,0));
	
	Результат 	= МИКО_аиAPI.СоздатьЗадачу(ДанныеЗадачи);
	Отказ 		= (Результат.result = Ложь); 
	Если Отказ Тогда
		Сообщить("Не вышло отправить задачу на сверер MikoPBX. Проверьте параметры подключения.");
		Возврат;
	ИначеЕсли НЕ ЗначениеЗаполнено(ИдентификаторЗадачи) Тогда
		ИдентификаторЗадачи = Результат.data.id;
		ОбменДанными.Загрузка = Истина;		Записать();	КонецЕсли;
	
	Если ИдентификаторЗадачи <> Число(Результат.data.id)  Тогда
		Сообщить("Был изменен идентификатор задачи на АТС с "+ИдентификаторЗадачи+" на "+Результат.data.id+".");
		ИдентификаторЗадачи = Результат.data.id;
		ОбменДанными.Загрузка = Истина;		Записать();	КонецЕсли;
	
	//Если Состояние <> 1 Тогда
	//	РезультатыЗадачи = МИКО_аиAPI.ПолучитьДанныеЗадачи(ИдентификаторЗадачи);
	//	Если РезультатыЗадачи.result = Истина Тогда 
	//		ЗадачаЗавершена = Истина;
	//		Для каждого result Из РезультатыЗадачи.data.results Цикл
	//			Если Число(result.closeTime) = 0  Тогда
	//				ЗадачаЗавершена = Ложь;
	//			КонецЕсли;
	//		КонецЦикла;
	//		
	//		Если ЗадачаЗавершена Тогда
	//			Состояние = 1; 
	//			Сообщить("По данным АТС все номера по текущей задаче были обработаны. Задача закрыта.");
	//		КонецЕсли;
	//	КонецЕсли;
	//КонецЕсли;	
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	ИдентификаторЗадачи = "";
	Состояние = 2;
	Для каждого Данные Из НомераТелефонов Цикл
		Данные.Статус = "";
	КонецЦикла;
КонецПроцедуры

